Reports/РасшифровкаРаспределенияТоваровВТорговойТочке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>РасшифровкаРаспределенияТоваровВТорговойТочке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id_TT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/РасшифровкаРаспределенияТоваровВТорговойТочке/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДатаНачала 		= '00010101';
	ДатаОкончания 	= '00010101';
	ТипСправочникНом = Тип("СправочникСсылка.Номенклатура");
	//ТекНоменклатура	= Неопределено;
	
	мЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ПользПоле Из мЭлементыНастроек Цикл
		Если ТипЗнч(ПользПоле) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(ПользПоле.Параметр) = "Период" Тогда
				ДатаНачала 		= ПользПоле.Значение.ДатаНачала;
				ДатаОкончания 	= КонецДня(ПользПоле.Значение.ДатаОкончания);
			КонецЕсли;
		//ИначеЕсли ТипЗнч(ПользПоле) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		//	Если ПользПоле.Использование = Истина Тогда
		//		Если ПользПоле.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		//			Если ТипЗнч(ПользПоле.ПравоеЗначение) = ТипСправочникТТ Тогда
		//				ТекНоменклатура = ПользПоле.ПравоеЗначение;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	
	//////////////////////////////
	// Получение данных и вывод //
	//////////////////////////////
	
	ТаблицаДанных = Отчеты.РасшифровкаРаспределенияТоваровВТорговойТочке.ПолучитьТаблицуДанных(ВнешниеДанные.ФорматПоля(ДатаНачала, Истина),
																								ВнешниеДанные.ФорматПоля(ДатаОкончания, Истина),
																								Формат(ЭтотОбъект.ТорговаяТочка.id_TT, "ЧГ="),
																								Формат(ЭтотОбъект.Номенклатура.id_tov, "ЧГ="));
								
	СтандартнаяОбработка = Ложь;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеДляФормирования", ТаблицаДанных);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТорговаяТочка.Пустая() Тогда
		Сообщить("Не определена торговая точка!");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
